// Задача 003 на сложение чисел
int numberA = 4;
int nunberB = 15;
int result = numberA + nunberB;
Console.WriteLine(result);

