// Задача 004 на определение частного после деления двух чисел
double numberA = 34;
double nunberB = 5;
Console.WriteLine(numberA/nunberB);


